In [13]:
import numpy as np 
import pandas as pd 
from datetime import datetime

In [2]:
df = pd.read_csv('employees.csv')

In [4]:
df

      Name Department  Salary      Joined
0    Alice         HR   50000  2020-01-10
1      Bob         IT   70000  2019-03-22
2  Charlie         IT   65000  2021-07-15
3    David      Sales   45000  2022-09-01
4      Eve         IT   72000  2018-05-20

In [5]:
df_IT = df[df['Department'] == 'IT']

In [6]:
df_IT

      Name Department  Salary      Joined
1      Bob         IT   70000  2019-03-22
2  Charlie         IT   65000  2021-07-15
4      Eve         IT   72000  2018-05-20

In [7]:
df_IT = df[(df['Department'] == 'IT') & (df['Salary'] > 65000)]

In [8]:
df_IT

  Name Department  Salary      Joined
1  Bob         IT   70000  2019-03-22
4  Eve         IT   72000  2018-05-20

In [11]:
df['Joined'] = pd.to_datetime(df['Joined'])

In [21]:
df['Yearsworked'] = df['Joined'].apply(
    lambda x: (datetime.now() - x).days // 365
)

In [22]:
df

      Name Department  Salary     Joined  Yearsworked
0    Alice         HR   50000 2020-01-10            5
1      Bob         IT   70000 2019-03-22            6
2  Charlie         IT   65000 2021-07-15            4
3    David      Sales   45000 2022-09-01            3
4      Eve         IT   72000 2018-05-20            7